СервисПриложения/src/Documents/ОтметкиСчетчика/ОтметкиСчетчика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтметкиСчетчика</name>
  <registerRecords>AccumulationRegister.РасчетыЗаУслуги</registerRecords>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>CatalogRef.Адреса</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУслуг</name>
    <type>
      <types>CatalogRef.НаборыУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрогийРежимОтметок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомленияВключены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отметки</name>
    <attributes>
      <name>ВремяОтметки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредыдущиеПоказания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущиеПоказания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СервисПриложения/src/Documents/ОтметкиСчетчика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
	// регистр РасчетыЗаУслуги
	Движения.РасчетыЗаУслуги.Записывать = Истина;
	ВидРасчета = Перечисления.ВидыЦены.Фактическая;
	Для Каждого Строка Из Отметки Цикл
		Расход = Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания; 
		ДельтаБаланса = -1 * Расход * РасчетыВызовСервера.ТарифДляНабораУслуг(НаборУслуг, ВидРасчета, Дата);
		РасчетыВызовСервера.ДобавитьДвижениеРасчетов(Движения, Строка.ВремяОтметки, НаборУслуг, ВидРасчета, Расход, ДельтаБаланса);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
